benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/no-tracing-exp/no-tracing-benchmark-60-9.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 40 connections
  Thread calibration: mean lat.: 1.309ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.337ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.28ms  667.87us   4.04ms   97.49%
    Req/Sec    30.78     57.62   222.00     74.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.17ms
 75.000%    1.31ms
 90.000%    1.48ms
 99.000%    4.04ms
 99.900%    9.86ms
 99.990%   12.39ms
 99.999%   12.39ms
100.000%   12.39ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.871     0.000000            1         1.00
       1.011     0.100000          295         1.11
       1.054     0.200000          600         1.25
       1.093     0.300000          887         1.43
       1.130     0.400000         1185         1.67
       1.170     0.500000         1477         2.00
       1.196     0.550000         1627         2.22
       1.219     0.600000         1772         2.50
       1.243     0.650000         1920         2.86
       1.274     0.700000         2066         3.33
       1.311     0.750000         2212         4.00
       1.326     0.775000         2284         4.44
       1.348     0.800000         2361         5.00
       1.377     0.825000         2433         5.71
       1.406     0.850000         2506         6.67
       1.443     0.875000         2580         8.00
       1.462     0.887500         2616         8.89
       1.485     0.900000         2653        10.00
       1.509     0.912500         2690        11.43
       1.542     0.925000         2726        13.33
       1.582     0.937500         2763        16.00
       1.595     0.943750         2783        17.78
       1.619     0.950000         2801        20.00
       1.642     0.956250         2819        22.86
       1.677     0.962500         2838        26.67
       1.757     0.968750         2855        32.00
       1.848     0.971875         2865        35.56
       1.953     0.975000         2874        40.00
       2.083     0.978125         2883        45.71
       2.269     0.981250         2892        53.33
       2.679     0.984375         2901        64.00
       3.095     0.985938         2906        71.11
       3.283     0.987500         2911        80.00
       3.703     0.989062         2915        91.43
       4.255     0.990625         2920       106.67
       4.815     0.992188         2924       128.00
       5.327     0.992969         2927       142.22
       6.051     0.993750         2929       160.00
       6.183     0.994531         2931       182.86
       7.307     0.995313         2934       213.33
       7.531     0.996094         2936       256.00
       7.703     0.996484         2937       284.44
       7.899     0.996875         2938       320.00
       8.207     0.997266         2939       365.71
       8.687     0.997656         2941       426.67
       9.055     0.998047         2942       512.00
       9.055     0.998242         2942       568.89
       9.567     0.998437         2943       640.00
       9.567     0.998633         2943       731.43
       9.863     0.998828         2944       853.33
      10.519     0.999023         2945      1024.00
      10.519     0.999121         2945      1137.78
      10.519     0.999219         2945      1280.00
      10.519     0.999316         2945      1462.86
      11.039     0.999414         2946      1706.67
      11.039     0.999512         2946      2048.00
      11.039     0.999561         2946      2275.56
      11.039     0.999609         2946      2560.00
      11.039     0.999658         2946      2925.71
      12.391     0.999707         2947      3413.33
      12.391     1.000000         2947          inf
#[Mean    =        1.281, StdDeviation   =        0.668]
#[Max     =       12.384, Total count    =         2947]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3592 requests in 1.00m, 698.05KB read
  Socket errors: connect 0, read 0, write 0, timeout 68
Requests/sec:     59.85
Transfer/sec:     11.63KB