benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/no-tracing-exp/no-tracing-benchmark-redeploy-40-3.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 40 connections
  Thread calibration: mean lat.: 1.794ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.793ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.71ms  798.60us   5.84ms   97.19%
    Req/Sec    21.07     46.93   200.00     81.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.64ms
 75.000%    1.78ms
 90.000%    1.90ms
 99.000%    5.84ms
 99.900%   11.17ms
 99.990%   13.80ms
 99.999%   13.80ms
100.000%   13.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.026     0.000000            1         1.00
       1.273     0.100000          200         1.11
       1.385     0.200000          399         1.25
       1.478     0.300000          598         1.43
       1.568     0.400000          797         1.67
       1.638     0.500000          996         2.00
       1.671     0.550000         1097         2.22
       1.699     0.600000         1197         2.50
       1.728     0.650000         1297         2.86
       1.759     0.700000         1398         3.33
       1.782     0.750000         1494         4.00
       1.797     0.775000         1545         4.44
       1.811     0.800000         1594         5.00
       1.834     0.825000         1645         5.71
       1.852     0.850000         1696         6.67
       1.872     0.875000         1743         8.00
       1.886     0.887500         1768         8.89
       1.904     0.900000         1793        10.00
       1.922     0.912500         1819        11.43
       1.942     0.925000         1843        13.33
       1.973     0.937500         1868        16.00
       1.992     0.943750         1880        17.78
       2.021     0.950000         1893        20.00
       2.063     0.956250         1906        22.86
       2.121     0.962500         1918        26.67
       2.297     0.968750         1930        32.00
       2.505     0.971875         1936        35.56
       2.843     0.975000         1943        40.00
       3.117     0.978125         1949        45.71
       3.641     0.981250         1955        53.33
       4.235     0.984375         1961        64.00
       4.407     0.985938         1964        71.11
       5.187     0.987500         1968        80.00
       5.603     0.989062         1971        91.43
       6.059     0.990625         1974       106.67
       6.591     0.992188         1977       128.00
       6.763     0.992969         1978       142.22
       6.811     0.993750         1980       160.00
       7.179     0.994531         1982       182.86
       7.639     0.995313         1983       213.33
       7.979     0.996094         1985       256.00
       7.979     0.996484         1985       284.44
       8.231     0.996875         1986       320.00
       8.287     0.997266         1987       365.71
      10.599     0.997656         1988       426.67
      11.071     0.998047         1989       512.00
      11.071     0.998242         1989       568.89
      11.071     0.998437         1989       640.00
      11.167     0.998633         1990       731.43
      11.167     0.998828         1990       853.33
      12.319     0.999023         1991      1024.00
      12.319     0.999121         1991      1137.78
      12.319     0.999219         1991      1280.00
      12.319     0.999316         1991      1462.86
      12.319     0.999414         1991      1706.67
      13.799     0.999512         1992      2048.00
      13.799     1.000000         1992          inf
#[Mean    =        1.708, StdDeviation   =        0.799]
#[Max     =       13.792, Total count    =         1992]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2411 requests in 1.00m, 468.54KB read
  Socket errors: connect 0, read 0, write 0, timeout 169
Requests/sec:     40.17
Transfer/sec:      7.81KB