benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/no-tracing-exp/no-tracing-benchmark-redeploy-40-6.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 40 connections
  Thread calibration: mean lat.: 1.897ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.835ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.88ms    1.72ms  10.49ms   95.70%
    Req/Sec    20.95     47.16   200.00     81.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.60ms
 75.000%    1.75ms
 90.000%    1.90ms
 99.000%   10.49ms
 99.900%   20.48ms
 99.990%   32.32ms
 99.999%   32.32ms
100.000%   32.32ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.017     0.000000            1         1.00
       1.240     0.100000          198         1.11
       1.353     0.200000          396         1.25
       1.454     0.300000          595         1.43
       1.526     0.400000          792         1.67
       1.601     0.500000          988         2.00
       1.636     0.550000         1088         2.22
       1.670     0.600000         1192         2.50
       1.693     0.650000         1288         2.86
       1.722     0.700000         1384         3.33
       1.751     0.750000         1482         4.00
       1.769     0.775000         1534         4.44
       1.785     0.800000         1581         5.00
       1.802     0.825000         1631         5.71
       1.830     0.850000         1680         6.67
       1.863     0.875000         1729         8.00
       1.880     0.887500         1754         8.89
       1.900     0.900000         1779        10.00
       1.932     0.912500         1805        11.43
       1.996     0.925000         1828        13.33
       2.213     0.937500         1853        16.00
       2.419     0.943750         1865        17.78
       3.067     0.950000         1878        20.00
       3.533     0.956250         1890        22.86
       4.523     0.962500         1902        26.67
       5.299     0.968750         1915        32.00
       5.991     0.971875         1921        35.56
       6.527     0.975000         1927        40.00
       7.711     0.978125         1933        45.71
       8.255     0.981250         1939        53.33
       8.799     0.984375         1946        64.00
       9.127     0.985938         1949        71.11
       9.631     0.987500         1952        80.00
      10.047     0.989062         1955        91.43
      10.919     0.990625         1958       106.67
      11.599     0.992188         1961       128.00
      11.863     0.992969         1963       142.22
      11.871     0.993750         1964       160.00
      11.991     0.994531         1966       182.86
      12.127     0.995313         1967       213.33
      13.511     0.996094         1969       256.00
      13.639     0.996484         1970       284.44
      13.639     0.996875         1970       320.00
      13.711     0.997266         1971       365.71
      15.639     0.997656         1972       426.67
      18.607     0.998047         1973       512.00
      18.607     0.998242         1973       568.89
      18.607     0.998437         1973       640.00
      20.479     0.998633         1974       731.43
      20.479     0.998828         1974       853.33
      24.831     0.999023         1975      1024.00
      24.831     0.999121         1975      1137.78
      24.831     0.999219         1975      1280.00
      24.831     0.999316         1975      1462.86
      24.831     0.999414         1975      1706.67
      32.319     0.999512         1976      2048.00
      32.319     1.000000         1976          inf
#[Mean    =        1.879, StdDeviation   =        1.721]
#[Max     =       32.304, Total count    =         1976]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2384 requests in 1.00m, 463.30KB read
  Socket errors: connect 0, read 0, write 0, timeout 154
Requests/sec:     39.72
Transfer/sec:      7.72KB